ant9000/yarm-arduino/boards.txt
yarm_edbg.name=Yarm (Programming Port)
yarm_edbg.vid.0=0x03eb
yarm_edbg.pid.0=0x6124

yarm_edbg.upload.tool=openocd
yarm_edbg.upload.protocol=sam-ba
yarm_edbg.upload.maximum_size=262144
yarm_edbg.upload.use_1200bps_touch=false
yarm_edbg.upload.wait_for_upload_port=false
yarm_edbg.upload.native_usb=false
yarm_edbg.build.mcu=cortex-m0plus
yarm_edbg.build.f_cpu=48000000L
yarm_edbg.build.usb_product="Yarm"
yarm_edbg.build.usb_manufacturer="Acmesystems"
yarm_edbg.build.board=YARM
yarm_edbg.build.core=acmesystems
yarm_edbg.build.extra_flags=-D__SAML21E18B__ {build.usb_flags}
yarm_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
yarm_edbg.build.openocdscript=openocd_scripts/yarm.cfg
yarm_edbg.build.variant=yarm
yarm_edbg.build.variant_system_lib=
yarm_edbg.build.vid=0x03eb
yarm_edbg.build.pid=0x6124
yarm_edbg.bootloader.tool=openocd
yarm_edbg.bootloader.file=yarm/yarm_bootloader.bin
